### Introduction to Pandas II

This lesson focuses on reviewing our basics with pandas and extending them to more advanced munging and cleaning.  Specifically, we will discuss how to load data files, work with missing values, use split-apply-combine, use string methods, and work with string and datetime objects.  By the end of this lesson you should feel confident doing basic exploratory data analysis using `pandas`. 

**OBJECTIVES**

- Read local files in as `DataFrame` objects
- Drop missing values
- Replace missing values
- Impute missing values
- Use `.groupby` 
- Use built in `.dt` methods
- Convert columns to `pd.datetime` datatype
- Work with `datetime` objects in pandas.

### Reading Local Files

To read in a local file, we need to pay close attention to our *working directory*.  This means the current location of your work enviornment with respect to your larger computer filesystem.  To find your working directory you can use the `os` library or if your system executes UNIX commands these can be used.

In [80]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [82]:
#pip install seaborn

In [83]:
#check working directory
os.getcwd()

'/Users/jacobkoehler/Desktop/fall_22/repo/notebooks/module_1/class_6'

In [84]:
#list all files in directory
os.listdir()

['.ipynb_checkpoints', 'data', 'pandas_II.ipynb']

In [85]:
#what's in the data folder?
os.listdir('data')

['diamonds.csv',
 'ufo.csv',
 'movie_ratings.tsv',
 'churn_missing.csv',
 'cars.csv',
 'AAPL.csv']

In [86]:
#what is the path to ufo.csv?
ufo_path = 'data/ufo.csv'

##### `read_csv`

Now, using the path to the `ufo.csv` file, you can create a DataFrame by passing this filepath to the `read_csv` function.

In [88]:
#read in ufo data
ufo = pd.read_csv(ufo_path)

In [89]:
# look at first 2 rows
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [90]:
# high level information
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             80496 non-null  object
 1   Colors Reported  17034 non-null  object
 2   Shape Reported   72141 non-null  object
 3   State            80543 non-null  object
 4   Time             80543 non-null  object
dtypes: object(5)
memory usage: 3.1+ MB

In [91]:
# numerical summaries
ufo.describe()

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [92]:
# categorical summaries
ufo.describe(include = 'object')

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [93]:
# all summaries
ufo.describe(include = 'all')

           City Colors Reported Shape Reported  State            Time
count     80496           17034          72141  80543           80543
unique    13504              31             27     52           68901
top     Seattle          ORANGE          LIGHT     CA  7/4/2014 22:00
freq        646            5216          16332  10743              45

In [94]:
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [97]:
tips.describe(include = 'all')

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

##### Reading from url

You can also load datasets from urls where a `.csv` (or other) file live.  Github is one example of this.  Note that you want to be sure to use the *raw* version of the file.  For example, a github user `dsnair` has shared datasets from the book [Introduction to Statistical Learning]() at the link below:


https://github.com/dsnair/ISLR/tree/master/data/csv

read in the Auto dataset below.

In [98]:
# get url to raw data
auto_url = 'https://raw.githubusercontent.com/dsnair/ISLR/master/data/csv/Auto.csv'

In [99]:
# pass to read_csv
auto = pd.read_csv(auto_url)

In [103]:
#auto.describe?

In [100]:
# look at the first few rows
auto.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320

In [101]:
# high level information
auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    int64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   year          392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(3), int64(5), object(1)
memory usage: 27.7+ KB

#### Problems

1. Read in the `diamonds.csv` file from the `data` folder, and create a DataFrame named `diamonds`.

In [104]:
diamonds_path = 'data/diamonds.csv'
diamonds = pd.read_csv(diamonds_path)
diamonds.head(1)

   carat    cut color clarity  depth  table  price     x     y     z
0   0.23  Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43

2. How many diamonds are greater than .5 carat in the data?

In [110]:
(diamonds['carat'] > .5).sum()

35008

In [107]:
diamonds.loc[diamonds['carat'] > .5].shape

(35008, 10)

3. What is the highest priced diamond in the data?

In [113]:
diamonds.iloc[:, 6].max() #rows, column

18823

In [114]:
max(diamonds['price'])

18823

In [117]:
diamonds.sort_values('price', ascending = False).head(1)

       carat      cut color clarity  depth  table  price    x     y     z
27749   2.29  Premium     I     VS2   60.8   60.0  18823  8.5  8.47  5.16

In [118]:
diamonds.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

4. Read the data from the `caravan.csv` file in located [here](https://github.com/dsnair/ISLR/blob/master/data/csv/Caravan.csv).  Assign this to a variable `caravan`.

In [119]:
caravan = pd.read_csv('https://raw.githubusercontent.com/dsnair/ISLR/master/data/csv/Caravan.csv')
caravan.head(2)

,MOSTYPE,MAANTHUI,MGEMOMV,MGEMLEEF,MOSHOOFD,MGODRK,MGODPR,MGODOV,MGODGE,MRELGE,...,APERSONG,AGEZONG,AWAOREG,ABRAND,AZEILPL,APLEZIER,AFIETS,AINBOED,ABYSTAND,Purchase
0,33,1,3,2,8,0,5,1,3,7,...,0,0,0,1,0,0,0,0,0,No
1,37,1,2,2,8,1,4,1,4,6,...,0,0,0,1,0,0,0,0,0,No

5. How many `Yes`'s are in the `Purchase` column of the `caravan` data?  No's?

In [120]:
len(caravan.loc[caravan['Purchase'] == 'Yes'])

348

In [121]:
caravan['Purchase'].value_counts()

No     5474
Yes     348
Name: Purchase, dtype: int64

### Missing Values

Missing values are a common problem in data, whether this is because they are truly missing or there is confusion between the data encoding and the methods you read the data in using.

In [21]:
# re-examine ufo info

In [38]:
# one-liner to count missing values

In [22]:
# drop missing values

In [23]:
# fill missing values

In [24]:
# replace missing values with most common value

In [25]:
# be careful with comparisons!!!

#### Problem

1. Read in the dataset `churn_missing.csv` in the data folder, assign to a variable `churn` below.

2. Are there any missing values?  What columns are they in and how many are there?

3. What do you think we should do about these?  Drop, replace, impute?

#### `groupby`

Often, you are faced with a dataset that you are interested in summaries within groups based on a condition.  The simplest condition is that of a unique value in a single column.  Using `.groupby` you can split your data into unique groups and summarize the results.  

**NOTE**: After splitting you need to summarize!

In [122]:
# sample data
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one -0.352188 -1.099828
1  bar    one -0.074360  0.604233
2  foo    two -0.605409  1.648036
3  bar  three -0.702154 -0.904479
4  foo    two -0.291115  0.503303
5  bar    two -3.063036 -0.810229
6  foo    one  0.323933  0.305337
7  foo  three -0.225277  1.618057

In [124]:
# foo vs. bar
df.groupby('A').mean()

<ipython-input-124-aff828ca885c>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('A').mean()

            C         D
A
bar -1.279850 -0.370158
foo -0.230011  0.594981

In [125]:
# one two or three?
df.groupby('B').mean()

<ipython-input-125-18a39a7bc6f1>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('B').mean()

              C         D
B
one   -0.034205 -0.063419
three -0.463716  0.356789
two   -1.319853  0.447037

In [126]:
# A and B
df.groupby(['A', 'B']).mean()

                  C         D
A   B
bar one   -0.074360  0.604233
    three -0.702154 -0.904479
    two   -3.063036 -0.810229
foo one   -0.014127 -0.397245
    three -0.225277  1.618057
    two   -0.448262  1.075670

In [129]:
# working with multi-index
df.groupby(['A', 'B'], as_index=False).mean()

     A      B         C         D
0  bar    one -0.074360  0.604233
1  bar  three -0.702154 -0.904479
2  bar    two -3.063036 -0.810229
3  foo    one -0.014127 -0.397245
4  foo  three -0.225277  1.618057
5  foo    two -0.448262  1.075670

In [133]:
# age less than 40 survival rate
titanic = sns.load_dataset('titanic')
titanic.groupby(titanic['age'] < 40)[['survived']].mean()

       survived
age
False  0.332353
True   0.415608

##### Problems

In [134]:
tips = sns.load_dataset('tips')

In [135]:
tips.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

1. Average tip for smokers vs. non-smokers.

In [136]:
tips.groupby('smoker')['tip'].mean()

smoker
Yes    3.008710
No     2.991854
Name: tip, dtype: float64

2. Average bill by day and time.

In [140]:
tips.groupby(['day', 'time'])[['total_bill']].mean()

             total_bill
day  time
Thur Lunch    17.664754
     Dinner   18.780000
Fri  Lunch    12.845714
     Dinner   19.663333
Sat  Lunch          NaN
     Dinner   20.441379
Sun  Lunch          NaN
     Dinner   21.410000

3. What is another question `groupby` can help us answer here?

4. What does the `as_index` argument do?  Demonstrate an example.

#### `datetime`

A special type of data for pandas are entities that can be considered as dates.  We can create a special datatype for these using `pd.to_datetime`, and access the functions of the `datetime` module as a result.

In [64]:
# read in the AAPL data

In [65]:
# convert to datetime

In [67]:
# extract the month

In [68]:
# extract the day

In [66]:
# set date to be index of data

In [69]:
# sort the index

In [70]:
# select 2019

In [71]:
# read back in using parse_dates = True and index_col = 0

In [72]:
from datetime import datetime

In [73]:
# what time is it?

In [74]:
# how much time has passed?

#### More with timestamps

- Date times: A specific date and time with timezone support. Similar to datetime.datetime from the standard library.

- Time deltas: An absolute time duration. Similar to datetime.timedelta from the standard library.

- Time spans: A span of time defined by a point in time and its associated frequency.

- Date offsets: A relative time duration that respects calendar arithmetic.

In [75]:
# most recent date?

In [76]:
# earliest?

In [77]:
# time range?

In [78]:
# create a pd.Timedelta

In [79]:
# shift a date by 3 months

##### Problems

1. Return to the ufo data and convert the Time column to a datetime object.

2. Set the Time column as the index column of the data.

3. Sort it

4. Create a new dataframe with ufo sightings since January 1, 1999

#### See you Thursday!